Revit 2024 API
FabricArea.IsValidMinorLapSplice Method
 Identifies if the specified value is valid for use as a minor lap splice.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidMinorLapSplice(
	double minorLapSplice
)
Visual Basic
Public Function IsValidMinorLapSplice ( _
	minorLapSplice As Double _
) As Boolean
Visual C++
public:
bool IsValidMinorLapSplice(
	double minorLapSplice
)
Parameters
minorLapSplice
Type: System.Double
 The minor lap splice value.
Return Value
 True if the value is valid, false if the value is invalid.
Remarks
 The minor lap splice should be less than or equal to half of the overall width.
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace